Repository: kudrikmed/flutter_facial_analytics_and_modeling
Catalog: lib/l10n/app_*.arb
Languages: ru

source: Hello World!
ru: Привет!

source: Select image
ru: Выбрать изображение

source: Transform image
ru: Обработать изображение

source: Select image from:
ru: Выбрать изображение из:

source: No image selected !
ru: Изображение не выбрано !

source: Gallery
ru: Галарея

source: No image captured !
ru: Изображение не выбрано !

source: Camera
ru: Камера

source: Upload image with portrait !
ru: Загрузите изображение с портретом !

source: Results
ru: Результаты

source: Analytics
ru: Аналитика

source: Modeling
ru: Моделирование

source: Lips analytics
ru: Аналитика губ

source: Mouth canthal tilt
ru: Угол наклона рта

source: Lips ratio
ru: Соотношение губ

source: Lower third ratio
ru: Соотношение нижней трети лица

source: Eyes analytics
ru: Аналитика глаз

source: Intercanthal tilt
ru: Угол наклона глазных щелей

source: Eyebrows analytics
ru: Аналитика бровей

# medialEyebrowTilt
source: Medial eyebrows tilt
ru: Медиальный угол подъема бровей

source: Eyebrow apex projection
ru: Проекция вершины брови

source: Facial form analytics
ru: Аналитика формы лица

source: Bigonial-bizygomatic ratio
ru: Соотношение нижней и средней третей лица

source: Lips
ru: Губы

source: Eyes
ru: Глаза

source: Eyebrows
ru: Брови

source: Face form
ru: Форма лица

source: Lips modeling
ru: Моделирование губ

source: Flat bow
ru: Плоский бант

source: French
ru: Французский метод

source: Vitreous
ru: Стеклышко

source: Save image
ru: Сохранить

source: Image saved
ru: Сохранено

source: Share image
ru: Поделиться

# mouthCornerAngleTheory
source: One of the many features that contribute to the aging appearance of the perioral region is the downward turn to the oral commissures. This downward turn, which often extends to a significant oral commissure groove and ‘‘marionette’’ appearance, gives a sad, tired, almost angry look in some patients.
ru: Одним из многих проявлений старения лица является опущение уголков рта. Это опущение, которое распространяется за пределы рта, придает многим печальный, усталый и даже сердитый вид.

# mouthCornerAnglePositive
source: Congratulations, in your case, gravitational ptosis of the facial soft tissues does not affect your corners of the mouth. This ensures an open and sincere smile and a rested, fresh appearance. To prevent the drooping of the mouth's corners, it is advisable to observe an adequate sleep regimen (at the same time, do not sleep on the face to prevent stretching of the facial skin) and monitor posture (correct posture helps to relax the neck muscles that pull the corners of the mouth down).
ru: Поздравляем, в Вашем случае гравитационный птоз мягких тканей лица не затрагивает Ваши уголки рта. Это обеспечивает открытую и искреннюю улыбку и отдохнувший, свежий внешний вид. Для профилактики опущения уголков рта целесообразно соблюдать адекватный режим сна (при этом не спать на лице для предотвращения растягивания кожи лица) и следить за осанкой (правильная осанка способстует расслаблению мышц шеи, которые тянут уголки рта вниз).

# mouthCornerAngleNegative
source: Share image
ru: Опущенные уголки рта слабо поддаются коррекции массажем или лицевой гимнастикой. Хорошим решением будет применение косметических процедур. Очень быстрый результат дает использование филлеров на основе гиалуроной кислоты. Также, подойдет применение нейропептидов (ботулотоксина). Дополнительным преимуществом данного метода является устранение мимических морщин и заломов кожи около рта. Кроме того, можно применить методику нитевого лифтинга, что одновременно позволит избавиться от носогубных складок. Существуют и пластические операции, выполняемые для поднятия уголков рта - корнер-лифтинг или пересечение мышцы ДАО.

# lipsRatioTheory
source: The fundamental proportions of the lips change as a person ages, with lengthening of the cutaneous portion of the upper lip and volume loss and thinning of the upper lip vermilion. It is considered to be, that in youthful people, the ideal ratio of the vertical height of the upper lip to that of the lower lip is 1:1.6 (Mandy et al). Meanwhile, in a 2017 study (Heidekrueger et al) researchers found that an upper to lower lip ratio closer to 1:1 was considered the most attractive. These findings are more consistent with recent trends in cosmetic medicine, with many clients aiming for a fuller upper lip.
ru: Основные пропорции губ изменяются с возрастом, при этом происходит удлинение кожной части верхней губы, потеря объема и истончение вермилиона верхней губы. Считается, что у молодых людей идеальное соотношение вертикальной высоты верхней и нижней губы составляет 1:1,6 (Mandy et al.). Между тем, в исследовании 2017 года (Heidekrueger et al.) указывается, что соотношение верхней и нижней губы ближе к 1:1 считается наиболее привлекательным. Эти результаты больше соответствуют последним тенденциям в косметической медицине, когда многие клиенты стремятся к более полной верхней губе.

# smallUpperLip
source: To harmonize the lower third of the face, it is desirable to increase the volume of the upper lip. The 'gold standard' for lip augmentation is the use of hyaluronic acid fillers. At the same time, synthetic polymers based on silicone and acrylic should be categorically avoided. In your case, contouring techniques with superficial filler injection are well suited - this will increase the volume of the upper lip, turn it forward, while not giving the effect of 'duck' lips. For a long-term result, surgical methods for increasing the upper lip can be applied - different types of cheiloplasty.
ru: Для гармонизации нижней трети лица желательно увеличить объем верхней губы. 'Золотым стандартом' для увеличения губ является применение филлеров на основе гиалуроновой кислоты. При этом, следует категорически избегать синтетических полимеров на основе силикона и акрила. В Вашем случае хорошо подойдут техники контурной пластики с поверхностным введением филлера - это увеличит объем верхней губы, развернет её кпереди, при этом не даст эффект 'утиных' губ. Для долговременного результата могут быть применены хирургические методы увеличения верхней губы - разные типы хейлопластики.

# bigUpperLip
source: To harmonize the lower third of the face, it is desirable to increase the volume of the upper lip. The 'gold standard' for lip augmentation is the use of hyaluronic acid fillers. At the same time, synthetic polymers based on silicone and acrylic should be categorically avoided. In your case, contouring techniques with superficial filler injection are well suited - this will increase the volume of the upper lip, turn it forward, while not giving the effect of 'duck' lips. For a long-term result, surgical methods for increasing the upper lip can be applied - different types of cheiloplasty.
ru: Для гармонизации нижней трети лица желательно увеличить объем верхней губы. 'Золотым стандартом' для увеличения губ является применение филлеров на основе гиалуроновой кислоты. При этом, следует категорически избегать синтетических полимеров на основе силикона и акрила. В Вашем случае хорошо подойдут техники контурной пластики с поверхностным введением филлера - это увеличит объем верхней губы, развернет её кпереди, при этом не даст эффект 'утиных' губ. Для долговременного результата могут быть применены хирургические методы увеличения верхней губы - разные типы хейлопластики.

# idealUpperLip
source: Congratulations, in your case the ratio of the upper and lower lips is ideal. To prevent the loss of volumes, it is recommended to observe the drinking regimen and avoid chapping of the lips.
ru: Поздравляем, в Вашем случае соотношение верхней и нижней губ идеальное. Для профилактики потери объемов рекомендуется соблюдать питьевой режим и избегать обветривания губ.

# upperLipRatioTheory
source: According to Anic-Milosevic el al the upper lip height occupies about one third of the face lower third in both genders (males 33.04%, females 32.38%)
ru: По данным Anic-Milosevic el al высота верхней губы занимает около одной трети от всей нижней трети лица у обоих полов (у мужчин 33,04%, у женщин 32,38%).

# bigWhiteUpperLip
source: In your case, there is an extension of the vertical size of the upper lip. This is one of the most significant subconscious signs of age. For a small correction, volumetric contouring of the upper and lower lips with fillers based on hyaluronic acid is suitable. For a more effective result, surgical correction - cheiloplasty - is indicated.
ru: В Вашем случе имеется удлинение вертикального размера верхней губы. Это один из самых значимых подсознательных признаков возраста. Для небольшой коррекции подойдет контурная объемная пластика верхней и нижней губы филлерами на основе гиалуроновой кислоты. Для более эффективного результата показано выполнение хирургической коррекции - хейлопластики.

# smallWhiteUpperLip
source: In your case, there is an imbalance in the lower third of the face with a decrease in the vertical size of the upper lip. The optimal method of correction is contour plastic surgery of the upper lip 'along the plane' with a filler based on hyaluronic acid. This will give a harmonious look to the lower third of the face without the effect of 'duck' lips. In addition, the aesthetics of the chin area should be additionally determined.
ru: В Вашем случае имеется дисбаланс нижней трети лица с уменьшением вертикального размера верхней губы. Оптимальным методом коррекции является контурная пластика верхней губы 'по плоскости' филлером на основании гиалуроновой кислоты. Это позволит придать гармоничный вид нижней трети лица без эффекта 'утиных' губ. Кроме того, следует дополнительно определить эстетику подбородочной области.

# idealWhiteUpperLip
source: In your case, there is an ideal ratio of the proportions in the lower third of the face. To prevent age-related changes, it is recommended to observe a drinking regime, to avoid chapping of the lips. Also an effective means of prevention is injection therapy of platelet-rich plasma.
ru: В Вашем случае наблюдается идеальное соотношение пропорций нижней трети лица. Для предотвращения возрастных изменений рекомендуется соблюдать питьевой режим, избегать обветривания губ. Также эффективным средством профилактики является инъекционная терапия обогащенной тромбоцитами плазмы.

# intercanthalTiltTheory
source: Canthal tilt is more accurately described as the inclination of the palpebral fissure (eyeopening). Bashour et al 2007 found that canthal tilt is a significant indicator in facial attractiveness with 93% of participants in the study preferring positive canthal tilts rather than negative ones. The сanthal tilt for an average face is 4.12° and for an attractive face is 7.13°.
ru: Межкантальный наклон можно определить как угол наклона глазной щели и в какой-то степени как 'разрез глаз'. Bashour et al 2007 обнаружили, что межкантальный наклон является важным показателем привлекательности лица: 93% участников исследования предпочитают положительный межкантальный наклон, а не отрицательный. При этом, межкантальный наклон в среднем составляет 4.12°. А для привлекательного лица угол наклона составляет 7.13°.

# canthalTiltIdeal
source: In your case, the cantal angle is ideal. This creates the effect of an attractive, slightly 'predatory' look. To prevent drooping of the outer corner of the eye, it is recommended to observe a sleep schedule and avoid certain mimic patterns - for example, stop 'squinting'.
ru: В Вашем случае кантальный угол наклона идеальный. Это создает эффект привлекательного, немного 'хищного' взгляда. Для профилактики опущения наружного уголка глаза рекомендуется соблюдать режим сна и избегать некоторых мимических паттернов - например, перестать 'щуриться'.

# canthalTiltLess
source: A feeling of 'sad' sight (the so-called 'basset hound sight'). In this case, cosmetic procedures - including contouring methods - will be ineffective. Performing surgical correction is indicated - blepharoplasty with canthopexy or temporal lifting.
ru: В Вашем случае уголки глаз опущены. Такая особенность формирует ощущение 'грустного' взгляда (так называемый 'basset hound sight'). В данном случае косметические процедуры - в том числе методы контурной пластики - будут малоэффективным. Показано выполнение хирургической коррекции - блефаропластики с кантопексией или височным лифтингом.

# canthalTiltAverage
source: Share image
ru: У Вас среднестатистический угол наклона глазной щели для взрослого человека. Увеличение данного угла - один из наиболее эффективных способов коррекции возрастных изменений. Из косметичеких процедур хороший эффект окажет нитевой лифтинг. Для продолжительного эффекта показано выполнение различных вариантов верхней расширенной блефаропластики.

# medialEyebrowTiltTheory
source: According to Griffin at al, there are several characteristics of the ideal youthful eyebrow. For example, medial brow segment with a takeoff angle of 15° to 25°
ru: По данным Griffin at al, существует несколько характеристик идеальной брови. Например, медиальный сегмент брови с углом взлета от 15° до 25°

# browMedialTiltBig
source: In your case, the inclination angle of the eyebrows is very high. This gives the face a surprised expression, which negatively affects its aesthetics. As a rule, invasive procedures are not required to reduce the angle of inclination, cosmetic correction of the eyebrows or permanent makeup is sufficient.
ru: В Вашем случае угол наклона бровей очень высокий. Это придает лицу удивленное выражение, что негативно сказывается на его эстетике. Как правило, для уменьшения угла наклона не требуется инвазивных процедур, достаточно косметической коррекции бровей или перманентного макияжа.

# browMedialTiltIdeal
source: In your case, the angle of the eyebrow is perfect. To prevent the drooping of the eyebrows, it is desirable to frown and wrinkle the forehead less. Injections of small doses of neuromodulators (botulinum toxin) into the brow area are also well suited.
ru: В Вашем случае угол наклона брови идеальный. Для профилактики опущения медиального угла бровей желательно меньше хмуриться и морщить лоб. Также хорошо подойдут инъекции малых доз нейромодуляторов (ботулотоксина) в межбровную область.

# browMedialTiltLow
source: The low inner angle of the eyebrows in your case gives the face a frown, which negatively affects its aesthetics. The classic way to correct the drooping of the medial angle of the eyebrow is the use of neuromodulators (botulinum toxin). Other effective techniques are thread lifting and, in rare cases, the injections of fillers. For a long-term effect, plastic surgery is indicated: endoscopic lifting of the eyebrows and forehead.
ru: Низкий внутренний угол наклона бровей в Вашем случае придает лицу хмурое выражение, что негативно сказывается на его эстетике. Классическим способом коррекции опущения медиального угла брови является применение нейромодуляторов (ботулотоксина). Другими эффективными методиками являются нитевой лифтинг и, в редких случаях, введение филлеров. Для долгосрочного эффекта показано выполнение пластических операций: эндоскопический лифтинг бровей и лба.

# browApexProjectionTheory
source: The brow peak is located at the lateral canthus for younger women. The older the patient, the more medial the brow peak can be.
ru: У молодых людей верхняя точка изгиба брови располагается у наружного угла глаза. Чем старше человек, тем более медиально может располагаться вершина изгиба брови.

# browApexIdeal
source: In your case, the position of the eyebrow bending point is outside the outer corner of the eye. This position gives the upper third of the face a young and attractive appearance. In this case, no adjustments are required.
ru: В Вашем случае положение точки изгиба брови находится за пределами наружного угла глаза. Такое положение придает верхней трети лица молодой и привлекательный вид. В данном случае никаких коррекций не требуется.

# browApexNormal
source: In your case, the position of the eyebrow bending point is near the outer corner of the eye. This shape of the eyebrow is found in most adults. To give the face a more youthful appearance, minimally invasive correction methods, such as thread lifting, are suitable. For a long-term result, a temporal lift with upper blepharoplasty is indicated. The popularity of this procedure is largely determined by the fact that Bella Hadid and Megan Fox resorted to it.
ru: В Вашем случае положение точки изгиба брови находится вблизи наружного угола глаза. Такая форма брови встречается у большинства взрослых людей. Для придания лицу более юного внешнего вида, подойдут малоинвазивные методы коррекции, например, нитевой лифтинг. Для долгосрочного результата показано выполнение височного лифтинга с верхней блефаропластикой. Популярность этой процедуры во многом определяет то, что к ней прибегали Белла Хадид и Меган Фокс.

# browApexLow
source: In your case, the position of the eyebrow bending point is displaced inwards. This gives the face a tired, sad look and visually adds age. For correction, contouring methods, such as thread lifts, are used. For a long-term result, a temporal lift with upper blepharoplasty is indicated.
ru: В Вашем случае положение точки изгиба брови смещено кнутри. Это придает лицу усталый, грустный вид и визуально добавляет возраст. Для коррекции используются методы контурной пластики, такие как нитевые лифтинги. Для долговременного результата показано выполнение височного лифтинга с верхней блефаропластикой.

# bigonialBizygomaticRatioTheory
source: Bigonial width, measured from the soft tissue overlying the most lateral point of each mandibular angle gonion, is usually 0.70−0.75 of bizygomatic width, measured from the most lateral point of the soft tissue overlying each zygomatic arch. This ratio indicates the ideal face shape in the form of a heart/diamond.
ru: Расстояние, измеренное между углами нижней челюсти, обычно составляет 0.70-0.75 от ширины расстояния, измеренного между наиболее выдающимися участками скуловых дуг. Это соотношение указывает на идеальную форму лица в форме сердца/ромба.

# bigonialBizygomaticIdeal
source: You have an ideal bigonial-biscule ratio. To preserve it, try to avoid volume methods of contouring the middle third of the face. Also, control your calcium and vitamin D levels. Osteomalacia can lead to both a change in the angle of the mandible and a loss of volume in the zygomatic bones. For long-term preservation of your ideal face shape, microcurrent therapy is well suited from instrumental methods, and thread lifts of the temporal region, as well as the middle and lower thirds of the face, are well suited from contour methods.
ru: У Вас идеальное бигониально-бискуловое соотношение. Для его сохранения старайтесь избегать объемных методов контурной пластики средней трети лица. Также, контролируйте уровень кальция и витамина D. Остеомаляция может привести как к изменению угла нижней челюсти, так и к потере объема скуловых костей. Для долговременного сохранения Вашей идеальной формы лица из аппаратных методов хорошо подойдет микротоковая терапия, а из контурных методов - нитевые лифтинги височной области, а также средней и нижней третей лица.

# bigonialBizygomaticMore
source: Your lower third of the face dominates over the middle third. For correction, you can move in two directions: reduce the volume of the lower third and increase the middle third. Non-invasive ultrasound and radio frequency lifts, fine needle laser and ultrasound lipoaspiration, SPACE surgical facelift or, preferably, SMAS, are effective procedures for reducing the volume of the lower third. Thread lifts will be ineffective due to the large mass of tissues in the lower third of the face - the threads will not withstand such a load. Also, do not expect much from skin care cosmetics or lipolytics. And to increase the volume of the middle third of the face, volumetric plastic with fillers is ideal. If your face is not prone to puffiness, you can use preparations based on hyaluronic acid. If the face periodically swells, fillers based on calcium hydroxyapatite will be the drug of choice. Also, a good result can be achieved by lipofilling. At the same time, excess adipose tissue can be taken just from the lower third of the face. Thread lifts of the middle third of the face will also be effective. This procedure will return the sagging soft tissues of the middle third of the face into place. Similarly, a surgical lift of the middle third of the face will work.
ru: У Вас нижняя треть лица преобладает над средней третью. Для коррекции можно двигаться в двух направлениях: уменьшить объем нижней трети и увеличить средней трети. Для уменьшения объема нижней трети эффективными процедурами являются неинвазивные ультразвуковые и радиочастотные лифтинги, тонкоигольная лазерная и ультразвуковые липоаспирации, хирургическая подтяжка лица по методу SPACE или, предпочтительнее, SMAS. Нитевые лифтинги будут малоэффективны в связи с большой массой тканей нижней трети лица - нити не выдержат такую нагрузку. Также не стоит много ожидать от уходовой косметики или липолитиков. А для увеличения объема средней трети лица идеально подойдет объемная пластика филлерами. Если Ваше лицо не склонно к отечности, можно применять препараты на основе гиалуроновой кислоты. Если же лицо периодически отекает - препаратом выбора будут филлеры на основе гидроксиапатита кальция. Также, хорошего результата можно добиться липофиллингом. При этом, избыток жировой ткани возможно забрать как раз из нижней трети лица. Также эффективны будут нитевые подтяжки средней трети лица. Данная процедура вернет опустившиеся мягкие ткани средней трети лица на место. Аналогично сработает и хирургическая подтяжка средней трети лица.

# bigonialBizygomaticLess
source: You have the middle third of the face prevailing over the lower third. As a rule, this is due to the involution of the mandible. For correction, injection contouring in the area of ​​the corners of the lower jaw is optimal. In this case, preference should be given to drugs based on calcium hydroxyapatite. Fillers with hyaluronic acid and lipofilling poorly restore the lower jaw area. Also, a contour thread lift of the lower third of the face and subchin area will show a good result.
ru: У Вас средняя треть лица преобладает над нижней третью. Как правило, это связано с инволюцией нижней челюсти. Для коррекции оптимально подойдет инъекционная контурная пластика в область углов нижней челюсти. При этом, предпочтение следует отдавать препаратам на основе гидроксиапатита кальция. Филлеры с гиалуроновой кислотой и липофиллинг плохо восстанавливают область нижней челюсти. Также, хороший результат покажет контурная нитевая подтяжка нижней трети лица и подподбородочной области.

# variant_one
source: Variant 1
ru: Вариант 1

# variant_two
source: Variant 2
ru: Вариант 2

# variant_three
source: Variant 3
ru: Вариант 3

# variant_four
source: Variant 4
ru: Вариант 4

# variant_five
source: Variant 5
ru: Вариант 5

# functionUnderDevelopment
source: Function is under development
ru: Функция в стадии разработки

source: Nose
ru: Нос
